Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/udphs.h
/* -------- UDPHS_EPTCTLENB : (UDPHS Offset: 0x04) ( /W 32) UDPHS Endpoint Control Enable Register (endpoint = 0) -------- */
#define UDPHS_EPTCTLENB_EPT_ENABL_Pos         _U_(0)                                               /**< (UDPHS_EPTCTLENB) Endpoint Enable Position */
#define UDPHS_EPTCTLENB_EPT_ENABL_Msk         (_U_(0x1) << UDPHS_EPTCTLENB_EPT_ENABL_Pos)          /**< (UDPHS_EPTCTLENB) Endpoint Enable Mask */
#define UDPHS_EPTCTLENB_EPT_ENABL(value)      (UDPHS_EPTCTLENB_EPT_ENABL_Msk & ((value) << UDPHS_EPTCTLENB_EPT_ENABL_Pos))
#define UDPHS_EPTCTLENB_AUTO_VALID_Pos        _U_(1)                                               /**< (UDPHS_EPTCTLENB) Packet Auto-Valid Enable Position */
#define UDPHS_EPTCTLENB_AUTO_VALID_Msk        (_U_(0x1) << UDPHS_EPTCTLENB_AUTO_VALID_Pos)         /**< (UDPHS_EPTCTLENB) Packet Auto-Valid Enable Mask */
#define UDPHS_EPTCTLENB_AUTO_VALID(value)     (UDPHS_EPTCTLENB_AUTO_VALID_Msk & ((value) << UDPHS_EPTCTLENB_AUTO_VALID_Pos))
#define UDPHS_EPTCTLENB_INTDIS_DMA_Pos        _U_(3)                                               /**< (UDPHS_EPTCTLENB) Interrupts Disable DMA Position */
#define UDPHS_EPTCTLENB_INTDIS_DMA_Msk        (_U_(0x1) << UDPHS_EPTCTLENB_INTDIS_DMA_Pos)         /**< (UDPHS_EPTCTLENB) Interrupts Disable DMA Mask */
#define UDPHS_EPTCTLENB_INTDIS_DMA(value)     (UDPHS_EPTCTLENB_INTDIS_DMA_Msk & ((value) << UDPHS_EPTCTLENB_INTDIS_DMA_Pos))
#define UDPHS_EPTCTLENB_NYET_DIS_Pos          _U_(4)                                               /**< (UDPHS_EPTCTLENB) NYET Disable (Only for High Speed Bulk OUT endpoints) Position */
#define UDPHS_EPTCTLENB_NYET_DIS_Msk          (_U_(0x1) << UDPHS_EPTCTLENB_NYET_DIS_Pos)           /**< (UDPHS_EPTCTLENB) NYET Disable (Only for High Speed Bulk OUT endpoints) Mask */
#define UDPHS_EPTCTLENB_NYET_DIS(value)       (UDPHS_EPTCTLENB_NYET_DIS_Msk & ((value) << UDPHS_EPTCTLENB_NYET_DIS_Pos))
#define UDPHS_EPTCTLENB_ERR_OVFLW_Pos         _U_(8)                                               /**< (UDPHS_EPTCTLENB) Overflow Error Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ERR_OVFLW_Msk         (_U_(0x1) << UDPHS_EPTCTLENB_ERR_OVFLW_Pos)          /**< (UDPHS_EPTCTLENB) Overflow Error Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ERR_OVFLW(value)      (UDPHS_EPTCTLENB_ERR_OVFLW_Msk & ((value) << UDPHS_EPTCTLENB_ERR_OVFLW_Pos))
#define UDPHS_EPTCTLENB_RXRDY_TXKL_Pos        _U_(9)                                               /**< (UDPHS_EPTCTLENB) Received OUT Data Interrupt Enable Position */
#define UDPHS_EPTCTLENB_RXRDY_TXKL_Msk        (_U_(0x1) << UDPHS_EPTCTLENB_RXRDY_TXKL_Pos)         /**< (UDPHS_EPTCTLENB) Received OUT Data Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_RXRDY_TXKL(value)     (UDPHS_EPTCTLENB_RXRDY_TXKL_Msk & ((value) << UDPHS_EPTCTLENB_RXRDY_TXKL_Pos))
#define UDPHS_EPTCTLENB_TX_COMPLT_Pos         _U_(10)                                              /**< (UDPHS_EPTCTLENB) Transmitted IN Data Complete Interrupt Enable Position */
#define UDPHS_EPTCTLENB_TX_COMPLT_Msk         (_U_(0x1) << UDPHS_EPTCTLENB_TX_COMPLT_Pos)          /**< (UDPHS_EPTCTLENB) Transmitted IN Data Complete Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_TX_COMPLT(value)      (UDPHS_EPTCTLENB_TX_COMPLT_Msk & ((value) << UDPHS_EPTCTLENB_TX_COMPLT_Pos))
#define UDPHS_EPTCTLENB_TXRDY_Pos             _U_(11)                                              /**< (UDPHS_EPTCTLENB) TX Packet Ready Interrupt Enable Position */
#define UDPHS_EPTCTLENB_TXRDY_Msk             (_U_(0x1) << UDPHS_EPTCTLENB_TXRDY_Pos)              /**< (UDPHS_EPTCTLENB) TX Packet Ready Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_TXRDY(value)          (UDPHS_EPTCTLENB_TXRDY_Msk & ((value) << UDPHS_EPTCTLENB_TXRDY_Pos))
#define UDPHS_EPTCTLENB_RX_SETUP_Pos          _U_(12)                                              /**< (UDPHS_EPTCTLENB) Received SETUP Position */
#define UDPHS_EPTCTLENB_RX_SETUP_Msk          (_U_(0x1) << UDPHS_EPTCTLENB_RX_SETUP_Pos)           /**< (UDPHS_EPTCTLENB) Received SETUP Mask */
#define UDPHS_EPTCTLENB_RX_SETUP(value)       (UDPHS_EPTCTLENB_RX_SETUP_Msk & ((value) << UDPHS_EPTCTLENB_RX_SETUP_Pos))
#define UDPHS_EPTCTLENB_STALL_SNT_Pos         _U_(13)                                              /**< (UDPHS_EPTCTLENB) Stall Sent Interrupt Enable Position */
#define UDPHS_EPTCTLENB_STALL_SNT_Msk         (_U_(0x1) << UDPHS_EPTCTLENB_STALL_SNT_Pos)          /**< (UDPHS_EPTCTLENB) Stall Sent Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_STALL_SNT(value)      (UDPHS_EPTCTLENB_STALL_SNT_Msk & ((value) << UDPHS_EPTCTLENB_STALL_SNT_Pos))
#define UDPHS_EPTCTLENB_NAK_IN_Pos            _U_(14)                                              /**< (UDPHS_EPTCTLENB) NAKIN Interrupt Enable Position */
#define UDPHS_EPTCTLENB_NAK_IN_Msk            (_U_(0x1) << UDPHS_EPTCTLENB_NAK_IN_Pos)             /**< (UDPHS_EPTCTLENB) NAKIN Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_NAK_IN(value)         (UDPHS_EPTCTLENB_NAK_IN_Msk & ((value) << UDPHS_EPTCTLENB_NAK_IN_Pos))
#define UDPHS_EPTCTLENB_NAK_OUT_Pos           _U_(15)                                              /**< (UDPHS_EPTCTLENB) NAKOUT Interrupt Enable Position */
#define UDPHS_EPTCTLENB_NAK_OUT_Msk           (_U_(0x1) << UDPHS_EPTCTLENB_NAK_OUT_Pos)            /**< (UDPHS_EPTCTLENB) NAKOUT Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_NAK_OUT(value)        (UDPHS_EPTCTLENB_NAK_OUT_Msk & ((value) << UDPHS_EPTCTLENB_NAK_OUT_Pos))
#define UDPHS_EPTCTLENB_BUSY_BANK_Pos         _U_(18)                                              /**< (UDPHS_EPTCTLENB) Busy Bank Interrupt Enable Position */
#define UDPHS_EPTCTLENB_BUSY_BANK_Msk         (_U_(0x1) << UDPHS_EPTCTLENB_BUSY_BANK_Pos)          /**< (UDPHS_EPTCTLENB) Busy Bank Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_BUSY_BANK(value)      (UDPHS_EPTCTLENB_BUSY_BANK_Msk & ((value) << UDPHS_EPTCTLENB_BUSY_BANK_Pos))
#define UDPHS_EPTCTLENB_SHRT_PCKT_Pos         _U_(31)                                              /**< (UDPHS_EPTCTLENB) Short Packet Send/Short Packet Interrupt Enable Position */
#define UDPHS_EPTCTLENB_SHRT_PCKT_Msk         (_U_(0x1) << UDPHS_EPTCTLENB_SHRT_PCKT_Pos)          /**< (UDPHS_EPTCTLENB) Short Packet Send/Short Packet Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_SHRT_PCKT(value)      (UDPHS_EPTCTLENB_SHRT_PCKT_Msk & ((value) << UDPHS_EPTCTLENB_SHRT_PCKT_Pos))
#define UDPHS_EPTCTLENB_Msk                   _U_(0x8004FF1B)                                      /**< (UDPHS_EPTCTLENB) Register Mask  */

