Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/udphs.h
/* ISOENDPT mode */
#define UDPHS_EPTCTL_ISOENDPT_EPT_ENABL_Pos   _U_(0)                                               /**< (UDPHS_EPTCTL) Endpoint Enable (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_EPT_ENABL_Msk   (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_EPT_ENABL_Pos)    /**< (UDPHS_EPTCTL) Endpoint Enable (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_EPT_ENABL(value) (UDPHS_EPTCTL_ISOENDPT_EPT_ENABL_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_EPT_ENABL_Pos))
#define UDPHS_EPTCTL_ISOENDPT_AUTO_VALID_Pos  _U_(1)                                               /**< (UDPHS_EPTCTL) Packet Auto-Valid Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_AUTO_VALID_Msk  (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_AUTO_VALID_Pos)   /**< (UDPHS_EPTCTL) Packet Auto-Valid Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_AUTO_VALID(value) (UDPHS_EPTCTL_ISOENDPT_AUTO_VALID_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_AUTO_VALID_Pos))
#define UDPHS_EPTCTL_ISOENDPT_INTDIS_DMA_Pos  _U_(3)                                               /**< (UDPHS_EPTCTL) Interrupt Disables DMA (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_INTDIS_DMA_Msk  (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_INTDIS_DMA_Pos)   /**< (UDPHS_EPTCTL) Interrupt Disables DMA (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_INTDIS_DMA(value) (UDPHS_EPTCTL_ISOENDPT_INTDIS_DMA_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_INTDIS_DMA_Pos))
#define UDPHS_EPTCTL_ISOENDPT_DATAX_RX_Pos    _U_(6)                                               /**< (UDPHS_EPTCTL) DATAx Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_DATAX_RX_Msk    (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_DATAX_RX_Pos)     /**< (UDPHS_EPTCTL) DATAx Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_DATAX_RX(value) (UDPHS_EPTCTL_ISOENDPT_DATAX_RX_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_DATAX_RX_Pos))
#define UDPHS_EPTCTL_ISOENDPT_MDATA_RX_Pos    _U_(7)                                               /**< (UDPHS_EPTCTL) MDATA Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_MDATA_RX_Msk    (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_MDATA_RX_Pos)     /**< (UDPHS_EPTCTL) MDATA Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_MDATA_RX(value) (UDPHS_EPTCTL_ISOENDPT_MDATA_RX_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_MDATA_RX_Pos))
#define UDPHS_EPTCTL_ISOENDPT_ERR_OVFLW_Pos   _U_(8)                                               /**< (UDPHS_EPTCTL) Overflow Error Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_ERR_OVFLW_Msk   (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_ERR_OVFLW_Pos)    /**< (UDPHS_EPTCTL) Overflow Error Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_ERR_OVFLW(value) (UDPHS_EPTCTL_ISOENDPT_ERR_OVFLW_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_ERR_OVFLW_Pos))
#define UDPHS_EPTCTL_ISOENDPT_RXRDY_TXKL_Pos  _U_(9)                                               /**< (UDPHS_EPTCTL) Received OUT Data Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_RXRDY_TXKL_Msk  (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_RXRDY_TXKL_Pos)   /**< (UDPHS_EPTCTL) Received OUT Data Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_RXRDY_TXKL(value) (UDPHS_EPTCTL_ISOENDPT_RXRDY_TXKL_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_RXRDY_TXKL_Pos))
#define UDPHS_EPTCTL_ISOENDPT_TX_COMPLT_Pos   _U_(10)                                              /**< (UDPHS_EPTCTL) Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_TX_COMPLT_Msk   (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_TX_COMPLT_Pos)    /**< (UDPHS_EPTCTL) Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_TX_COMPLT(value) (UDPHS_EPTCTL_ISOENDPT_TX_COMPLT_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_TX_COMPLT_Pos))
#define UDPHS_EPTCTL_ISOENDPT_TXRDY_TRER_Pos  _U_(11)                                              /**< (UDPHS_EPTCTL) TX Packet Ready/Transaction Error Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_TXRDY_TRER_Msk  (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_TXRDY_TRER_Pos)   /**< (UDPHS_EPTCTL) TX Packet Ready/Transaction Error Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_TXRDY_TRER(value) (UDPHS_EPTCTL_ISOENDPT_TXRDY_TRER_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_TXRDY_TRER_Pos))
#define UDPHS_EPTCTL_ISOENDPT_ERR_FL_ISO_Pos  _U_(12)                                              /**< (UDPHS_EPTCTL) Error Flow Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_ERR_FL_ISO_Msk  (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_ERR_FL_ISO_Pos)   /**< (UDPHS_EPTCTL) Error Flow Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_ERR_FL_ISO(value) (UDPHS_EPTCTL_ISOENDPT_ERR_FL_ISO_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_ERR_FL_ISO_Pos))
#define UDPHS_EPTCTL_ISOENDPT_ERR_CRC_NTR_Pos _U_(13)                                              /**< (UDPHS_EPTCTL) ISO CRC Error/Number of Transaction Error Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_ERR_CRC_NTR_Msk (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_ERR_CRC_NTR_Pos)  /**< (UDPHS_EPTCTL) ISO CRC Error/Number of Transaction Error Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_ERR_CRC_NTR(value) (UDPHS_EPTCTL_ISOENDPT_ERR_CRC_NTR_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_ERR_CRC_NTR_Pos))
#define UDPHS_EPTCTL_ISOENDPT_ERR_FLUSH_Pos   _U_(14)                                              /**< (UDPHS_EPTCTL) Bank Flush Error Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_ERR_FLUSH_Msk   (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_ERR_FLUSH_Pos)    /**< (UDPHS_EPTCTL) Bank Flush Error Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_ERR_FLUSH(value) (UDPHS_EPTCTL_ISOENDPT_ERR_FLUSH_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_ERR_FLUSH_Pos))
#define UDPHS_EPTCTL_ISOENDPT_BUSY_BANK_Pos   _U_(18)                                              /**< (UDPHS_EPTCTL) Busy Bank Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_BUSY_BANK_Msk   (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_BUSY_BANK_Pos)    /**< (UDPHS_EPTCTL) Busy Bank Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_BUSY_BANK(value) (UDPHS_EPTCTL_ISOENDPT_BUSY_BANK_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_BUSY_BANK_Pos))
#define UDPHS_EPTCTL_ISOENDPT_SHRT_PCKT_Pos   _U_(31)                                              /**< (UDPHS_EPTCTL) Short Packet Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ISOENDPT_SHRT_PCKT_Msk   (_U_(0x1) << UDPHS_EPTCTL_ISOENDPT_SHRT_PCKT_Pos)    /**< (UDPHS_EPTCTL) Short Packet Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ISOENDPT_SHRT_PCKT(value) (UDPHS_EPTCTL_ISOENDPT_SHRT_PCKT_Msk & ((value) << UDPHS_EPTCTL_ISOENDPT_SHRT_PCKT_Pos))
#define UDPHS_EPTCTL_ISOENDPT_Msk             _U_(0x80047FCB)                                       /**< (UDPHS_EPTCTL_ISOENDPT) Register Mask  */


/* -------- UDPHS_EPTSETSTA : (UDPHS Offset: 0x14) ( /W 32) UDPHS Endpoint Set Status Register (endpoint = 0) -------- */
#define UDPHS_EPTSETSTA_FRCESTALL_Pos         _U_(5)                                               /**< (UDPHS_EPTSETSTA) Stall Handshake Request Set Position */
#define UDPHS_EPTSETSTA_FRCESTALL_Msk         (_U_(0x1) << UDPHS_EPTSETSTA_FRCESTALL_Pos)          /**< (UDPHS_EPTSETSTA) Stall Handshake Request Set Mask */
#define UDPHS_EPTSETSTA_FRCESTALL(value)      (UDPHS_EPTSETSTA_FRCESTALL_Msk & ((value) << UDPHS_EPTSETSTA_FRCESTALL_Pos))
#define UDPHS_EPTSETSTA_RXRDY_TXKL_Pos        _U_(9)                                               /**< (UDPHS_EPTSETSTA) KILL Bank Set (for IN Endpoint) Position */
#define UDPHS_EPTSETSTA_RXRDY_TXKL_Msk        (_U_(0x1) << UDPHS_EPTSETSTA_RXRDY_TXKL_Pos)         /**< (UDPHS_EPTSETSTA) KILL Bank Set (for IN Endpoint) Mask */
#define UDPHS_EPTSETSTA_RXRDY_TXKL(value)     (UDPHS_EPTSETSTA_RXRDY_TXKL_Msk & ((value) << UDPHS_EPTSETSTA_RXRDY_TXKL_Pos))
#define UDPHS_EPTSETSTA_TXRDY_Pos             _U_(11)                                              /**< (UDPHS_EPTSETSTA) TX Packet Ready Set Position */
#define UDPHS_EPTSETSTA_TXRDY_Msk             (_U_(0x1) << UDPHS_EPTSETSTA_TXRDY_Pos)              /**< (UDPHS_EPTSETSTA) TX Packet Ready Set Mask */
#define UDPHS_EPTSETSTA_TXRDY(value)          (UDPHS_EPTSETSTA_TXRDY_Msk & ((value) << UDPHS_EPTSETSTA_TXRDY_Pos))
#define UDPHS_EPTSETSTA_Msk                   _U_(0x00000A20)                                      /**< (UDPHS_EPTSETSTA) Register Mask  */

