Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/udphs.h
/* ISOENDPT mode */
#define UDPHS_EPTSETSTA_ISOENDPT_RXRDY_TXKL_Pos _U_(9)                                               /**< (UDPHS_EPTSETSTA) KILL Bank Set (for IN Endpoint) Position */
#define UDPHS_EPTSETSTA_ISOENDPT_RXRDY_TXKL_Msk (_U_(0x1) << UDPHS_EPTSETSTA_ISOENDPT_RXRDY_TXKL_Pos) /**< (UDPHS_EPTSETSTA) KILL Bank Set (for IN Endpoint) Mask */
#define UDPHS_EPTSETSTA_ISOENDPT_RXRDY_TXKL(value) (UDPHS_EPTSETSTA_ISOENDPT_RXRDY_TXKL_Msk & ((value) << UDPHS_EPTSETSTA_ISOENDPT_RXRDY_TXKL_Pos))
#define UDPHS_EPTSETSTA_ISOENDPT_TXRDY_TRER_Pos _U_(11)                                              /**< (UDPHS_EPTSETSTA) TX Packet Ready Set Position */
#define UDPHS_EPTSETSTA_ISOENDPT_TXRDY_TRER_Msk (_U_(0x1) << UDPHS_EPTSETSTA_ISOENDPT_TXRDY_TRER_Pos) /**< (UDPHS_EPTSETSTA) TX Packet Ready Set Mask */
#define UDPHS_EPTSETSTA_ISOENDPT_TXRDY_TRER(value) (UDPHS_EPTSETSTA_ISOENDPT_TXRDY_TRER_Msk & ((value) << UDPHS_EPTSETSTA_ISOENDPT_TXRDY_TRER_Pos))
#define UDPHS_EPTSETSTA_ISOENDPT_Msk          _U_(0x00000A00)                                       /**< (UDPHS_EPTSETSTA_ISOENDPT) Register Mask  */


/* -------- UDPHS_EPTCLRSTA : (UDPHS Offset: 0x18) ( /W 32) UDPHS Endpoint Clear Status Register (endpoint = 0) -------- */
#define UDPHS_EPTCLRSTA_FRCESTALL_Pos         _U_(5)                                               /**< (UDPHS_EPTCLRSTA) Stall Handshake Request Clear Position */
#define UDPHS_EPTCLRSTA_FRCESTALL_Msk         (_U_(0x1) << UDPHS_EPTCLRSTA_FRCESTALL_Pos)          /**< (UDPHS_EPTCLRSTA) Stall Handshake Request Clear Mask */
#define UDPHS_EPTCLRSTA_FRCESTALL(value)      (UDPHS_EPTCLRSTA_FRCESTALL_Msk & ((value) << UDPHS_EPTCLRSTA_FRCESTALL_Pos))
#define UDPHS_EPTCLRSTA_TOGGLESQ_Pos          _U_(6)                                               /**< (UDPHS_EPTCLRSTA) Data Toggle Clear Position */
#define UDPHS_EPTCLRSTA_TOGGLESQ_Msk          (_U_(0x1) << UDPHS_EPTCLRSTA_TOGGLESQ_Pos)           /**< (UDPHS_EPTCLRSTA) Data Toggle Clear Mask */
#define UDPHS_EPTCLRSTA_TOGGLESQ(value)       (UDPHS_EPTCLRSTA_TOGGLESQ_Msk & ((value) << UDPHS_EPTCLRSTA_TOGGLESQ_Pos))
#define UDPHS_EPTCLRSTA_RXRDY_TXKL_Pos        _U_(9)                                               /**< (UDPHS_EPTCLRSTA) Received OUT Data Clear Position */
#define UDPHS_EPTCLRSTA_RXRDY_TXKL_Msk        (_U_(0x1) << UDPHS_EPTCLRSTA_RXRDY_TXKL_Pos)         /**< (UDPHS_EPTCLRSTA) Received OUT Data Clear Mask */
#define UDPHS_EPTCLRSTA_RXRDY_TXKL(value)     (UDPHS_EPTCLRSTA_RXRDY_TXKL_Msk & ((value) << UDPHS_EPTCLRSTA_RXRDY_TXKL_Pos))
#define UDPHS_EPTCLRSTA_TX_COMPLT_Pos         _U_(10)                                              /**< (UDPHS_EPTCLRSTA) Transmitted IN Data Complete Clear Position */
#define UDPHS_EPTCLRSTA_TX_COMPLT_Msk         (_U_(0x1) << UDPHS_EPTCLRSTA_TX_COMPLT_Pos)          /**< (UDPHS_EPTCLRSTA) Transmitted IN Data Complete Clear Mask */
#define UDPHS_EPTCLRSTA_TX_COMPLT(value)      (UDPHS_EPTCLRSTA_TX_COMPLT_Msk & ((value) << UDPHS_EPTCLRSTA_TX_COMPLT_Pos))
#define UDPHS_EPTCLRSTA_RX_SETUP_Pos          _U_(12)                                              /**< (UDPHS_EPTCLRSTA) Received SETUP Clear Position */
#define UDPHS_EPTCLRSTA_RX_SETUP_Msk          (_U_(0x1) << UDPHS_EPTCLRSTA_RX_SETUP_Pos)           /**< (UDPHS_EPTCLRSTA) Received SETUP Clear Mask */
#define UDPHS_EPTCLRSTA_RX_SETUP(value)       (UDPHS_EPTCLRSTA_RX_SETUP_Msk & ((value) << UDPHS_EPTCLRSTA_RX_SETUP_Pos))
#define UDPHS_EPTCLRSTA_STALL_SNT_Pos         _U_(13)                                              /**< (UDPHS_EPTCLRSTA) Stall Sent Clear Position */
#define UDPHS_EPTCLRSTA_STALL_SNT_Msk         (_U_(0x1) << UDPHS_EPTCLRSTA_STALL_SNT_Pos)          /**< (UDPHS_EPTCLRSTA) Stall Sent Clear Mask */
#define UDPHS_EPTCLRSTA_STALL_SNT(value)      (UDPHS_EPTCLRSTA_STALL_SNT_Msk & ((value) << UDPHS_EPTCLRSTA_STALL_SNT_Pos))
#define UDPHS_EPTCLRSTA_NAK_IN_Pos            _U_(14)                                              /**< (UDPHS_EPTCLRSTA) NAKIN Clear Position */
#define UDPHS_EPTCLRSTA_NAK_IN_Msk            (_U_(0x1) << UDPHS_EPTCLRSTA_NAK_IN_Pos)             /**< (UDPHS_EPTCLRSTA) NAKIN Clear Mask */
#define UDPHS_EPTCLRSTA_NAK_IN(value)         (UDPHS_EPTCLRSTA_NAK_IN_Msk & ((value) << UDPHS_EPTCLRSTA_NAK_IN_Pos))
#define UDPHS_EPTCLRSTA_NAK_OUT_Pos           _U_(15)                                              /**< (UDPHS_EPTCLRSTA) NAKOUT Clear Position */
#define UDPHS_EPTCLRSTA_NAK_OUT_Msk           (_U_(0x1) << UDPHS_EPTCLRSTA_NAK_OUT_Pos)            /**< (UDPHS_EPTCLRSTA) NAKOUT Clear Mask */
#define UDPHS_EPTCLRSTA_NAK_OUT(value)        (UDPHS_EPTCLRSTA_NAK_OUT_Msk & ((value) << UDPHS_EPTCLRSTA_NAK_OUT_Pos))
#define UDPHS_EPTCLRSTA_Msk                   _U_(0x0000F660)                                      /**< (UDPHS_EPTCLRSTA) Register Mask  */

/* ISOENDPT mode */
#define UDPHS_EPTCLRSTA_ISOENDPT_TOGGLESQ_Pos _U_(6)                                               /**< (UDPHS_EPTCLRSTA) Data Toggle Clear Position */
#define UDPHS_EPTCLRSTA_ISOENDPT_TOGGLESQ_Msk (_U_(0x1) << UDPHS_EPTCLRSTA_ISOENDPT_TOGGLESQ_Pos)  /**< (UDPHS_EPTCLRSTA) Data Toggle Clear Mask */
#define UDPHS_EPTCLRSTA_ISOENDPT_TOGGLESQ(value) (UDPHS_EPTCLRSTA_ISOENDPT_TOGGLESQ_Msk & ((value) << UDPHS_EPTCLRSTA_ISOENDPT_TOGGLESQ_Pos))
#define UDPHS_EPTCLRSTA_ISOENDPT_RXRDY_TXKL_Pos _U_(9)                                               /**< (UDPHS_EPTCLRSTA) Received OUT Data Clear Position */
#define UDPHS_EPTCLRSTA_ISOENDPT_RXRDY_TXKL_Msk (_U_(0x1) << UDPHS_EPTCLRSTA_ISOENDPT_RXRDY_TXKL_Pos) /**< (UDPHS_EPTCLRSTA) Received OUT Data Clear Mask */
#define UDPHS_EPTCLRSTA_ISOENDPT_RXRDY_TXKL(value) (UDPHS_EPTCLRSTA_ISOENDPT_RXRDY_TXKL_Msk & ((value) << UDPHS_EPTCLRSTA_ISOENDPT_RXRDY_TXKL_Pos))
#define UDPHS_EPTCLRSTA_ISOENDPT_TX_COMPLT_Pos _U_(10)                                              /**< (UDPHS_EPTCLRSTA) Transmitted IN Data Complete Clear Position */
#define UDPHS_EPTCLRSTA_ISOENDPT_TX_COMPLT_Msk (_U_(0x1) << UDPHS_EPTCLRSTA_ISOENDPT_TX_COMPLT_Pos) /**< (UDPHS_EPTCLRSTA) Transmitted IN Data Complete Clear Mask */
#define UDPHS_EPTCLRSTA_ISOENDPT_TX_COMPLT(value) (UDPHS_EPTCLRSTA_ISOENDPT_TX_COMPLT_Msk & ((value) << UDPHS_EPTCLRSTA_ISOENDPT_TX_COMPLT_Pos))
#define UDPHS_EPTCLRSTA_ISOENDPT_ERR_FL_ISO_Pos _U_(12)                                              /**< (UDPHS_EPTCLRSTA) Error Flow Clear Position */
#define UDPHS_EPTCLRSTA_ISOENDPT_ERR_FL_ISO_Msk (_U_(0x1) << UDPHS_EPTCLRSTA_ISOENDPT_ERR_FL_ISO_Pos) /**< (UDPHS_EPTCLRSTA) Error Flow Clear Mask */
#define UDPHS_EPTCLRSTA_ISOENDPT_ERR_FL_ISO(value) (UDPHS_EPTCLRSTA_ISOENDPT_ERR_FL_ISO_Msk & ((value) << UDPHS_EPTCLRSTA_ISOENDPT_ERR_FL_ISO_Pos))
#define UDPHS_EPTCLRSTA_ISOENDPT_ERR_CRC_NTR_Pos _U_(13)                                              /**< (UDPHS_EPTCLRSTA) Number of Transaction Error Clear Position */
#define UDPHS_EPTCLRSTA_ISOENDPT_ERR_CRC_NTR_Msk (_U_(0x1) << UDPHS_EPTCLRSTA_ISOENDPT_ERR_CRC_NTR_Pos) /**< (UDPHS_EPTCLRSTA) Number of Transaction Error Clear Mask */
#define UDPHS_EPTCLRSTA_ISOENDPT_ERR_CRC_NTR(value) (UDPHS_EPTCLRSTA_ISOENDPT_ERR_CRC_NTR_Msk & ((value) << UDPHS_EPTCLRSTA_ISOENDPT_ERR_CRC_NTR_Pos))
#define UDPHS_EPTCLRSTA_ISOENDPT_ERR_FLUSH_Pos _U_(14)                                              /**< (UDPHS_EPTCLRSTA) Bank Flush Error Clear Position */
#define UDPHS_EPTCLRSTA_ISOENDPT_ERR_FLUSH_Msk (_U_(0x1) << UDPHS_EPTCLRSTA_ISOENDPT_ERR_FLUSH_Pos) /**< (UDPHS_EPTCLRSTA) Bank Flush Error Clear Mask */
#define UDPHS_EPTCLRSTA_ISOENDPT_ERR_FLUSH(value) (UDPHS_EPTCLRSTA_ISOENDPT_ERR_FLUSH_Msk & ((value) << UDPHS_EPTCLRSTA_ISOENDPT_ERR_FLUSH_Pos))
#define UDPHS_EPTCLRSTA_ISOENDPT_Msk          _U_(0x00007640)                                       /**< (UDPHS_EPTCLRSTA_ISOENDPT) Register Mask  */


/* -------- UDPHS_EPTSTA : (UDPHS Offset: 0x1C) ( R/ 32) UDPHS Endpoint Status Register (endpoint = 0) -------- */
#define UDPHS_EPTSTA_FRCESTALL_Pos            _U_(5)                                               /**< (UDPHS_EPTSTA) Stall Handshake Request (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_FRCESTALL_Msk            (_U_(0x1) << UDPHS_EPTSTA_FRCESTALL_Pos)             /**< (UDPHS_EPTSTA) Stall Handshake Request (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_FRCESTALL(value)         (UDPHS_EPTSTA_FRCESTALL_Msk & ((value) << UDPHS_EPTSTA_FRCESTALL_Pos))
#define UDPHS_EPTSTA_TOGGLESQ_STA_Pos         _U_(6)                                               /**< (UDPHS_EPTSTA) Toggle Sequencing (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_TOGGLESQ_STA_Msk         (_U_(0x3) << UDPHS_EPTSTA_TOGGLESQ_STA_Pos)          /**< (UDPHS_EPTSTA) Toggle Sequencing (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_TOGGLESQ_STA(value)      (UDPHS_EPTSTA_TOGGLESQ_STA_Msk & ((value) << UDPHS_EPTSTA_TOGGLESQ_STA_Pos))
#define   UDPHS_EPTSTA_TOGGLESQ_STA_DATA0_Val _U_(0x0)                                             /**< (UDPHS_EPTSTA) DATA0  */
#define   UDPHS_EPTSTA_TOGGLESQ_STA_DATA1_Val _U_(0x1)                                             /**< (UDPHS_EPTSTA) DATA1  */
#define   UDPHS_EPTSTA_TOGGLESQ_STA_DATA2_Val _U_(0x2)                                             /**< (UDPHS_EPTSTA) Reserved for High Bandwidth Isochronous Endpoint  */
#define   UDPHS_EPTSTA_TOGGLESQ_STA_MDATA_Val _U_(0x3)                                             /**< (UDPHS_EPTSTA) Reserved for High Bandwidth Isochronous Endpoint  */
#define UDPHS_EPTSTA_TOGGLESQ_STA_DATA0       (UDPHS_EPTSTA_TOGGLESQ_STA_DATA0_Val << UDPHS_EPTSTA_TOGGLESQ_STA_Pos) /**< (UDPHS_EPTSTA) DATA0 Position  */
#define UDPHS_EPTSTA_TOGGLESQ_STA_DATA1       (UDPHS_EPTSTA_TOGGLESQ_STA_DATA1_Val << UDPHS_EPTSTA_TOGGLESQ_STA_Pos) /**< (UDPHS_EPTSTA) DATA1 Position  */
#define UDPHS_EPTSTA_TOGGLESQ_STA_DATA2       (UDPHS_EPTSTA_TOGGLESQ_STA_DATA2_Val << UDPHS_EPTSTA_TOGGLESQ_STA_Pos) /**< (UDPHS_EPTSTA) Reserved for High Bandwidth Isochronous Endpoint Position  */
#define UDPHS_EPTSTA_TOGGLESQ_STA_MDATA       (UDPHS_EPTSTA_TOGGLESQ_STA_MDATA_Val << UDPHS_EPTSTA_TOGGLESQ_STA_Pos) /**< (UDPHS_EPTSTA) Reserved for High Bandwidth Isochronous Endpoint Position  */
#define UDPHS_EPTSTA_ERR_OVFLW_Pos            _U_(8)                                               /**< (UDPHS_EPTSTA) Overflow Error (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ERR_OVFLW_Msk            (_U_(0x1) << UDPHS_EPTSTA_ERR_OVFLW_Pos)             /**< (UDPHS_EPTSTA) Overflow Error (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ERR_OVFLW(value)         (UDPHS_EPTSTA_ERR_OVFLW_Msk & ((value) << UDPHS_EPTSTA_ERR_OVFLW_Pos))
#define UDPHS_EPTSTA_RXRDY_TXKL_Pos           _U_(9)                                               /**< (UDPHS_EPTSTA) Received OUT Data/KILL Bank (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_RXRDY_TXKL_Msk           (_U_(0x1) << UDPHS_EPTSTA_RXRDY_TXKL_Pos)            /**< (UDPHS_EPTSTA) Received OUT Data/KILL Bank (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_RXRDY_TXKL(value)        (UDPHS_EPTSTA_RXRDY_TXKL_Msk & ((value) << UDPHS_EPTSTA_RXRDY_TXKL_Pos))
#define UDPHS_EPTSTA_TX_COMPLT_Pos            _U_(10)                                              /**< (UDPHS_EPTSTA) Transmitted IN Data Complete (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_TX_COMPLT_Msk            (_U_(0x1) << UDPHS_EPTSTA_TX_COMPLT_Pos)             /**< (UDPHS_EPTSTA) Transmitted IN Data Complete (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_TX_COMPLT(value)         (UDPHS_EPTSTA_TX_COMPLT_Msk & ((value) << UDPHS_EPTSTA_TX_COMPLT_Pos))
#define UDPHS_EPTSTA_TXRDY_Pos                _U_(11)                                              /**< (UDPHS_EPTSTA) TX Packet Ready (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_TXRDY_Msk                (_U_(0x1) << UDPHS_EPTSTA_TXRDY_Pos)                 /**< (UDPHS_EPTSTA) TX Packet Ready (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_TXRDY(value)             (UDPHS_EPTSTA_TXRDY_Msk & ((value) << UDPHS_EPTSTA_TXRDY_Pos))
#define UDPHS_EPTSTA_RX_SETUP_Pos             _U_(12)                                              /**< (UDPHS_EPTSTA) Received SETUP (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_RX_SETUP_Msk             (_U_(0x1) << UDPHS_EPTSTA_RX_SETUP_Pos)              /**< (UDPHS_EPTSTA) Received SETUP (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_RX_SETUP(value)          (UDPHS_EPTSTA_RX_SETUP_Msk & ((value) << UDPHS_EPTSTA_RX_SETUP_Pos))
#define UDPHS_EPTSTA_STALL_SNT_Pos            _U_(13)                                              /**< (UDPHS_EPTSTA) Stall Sent (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_STALL_SNT_Msk            (_U_(0x1) << UDPHS_EPTSTA_STALL_SNT_Pos)             /**< (UDPHS_EPTSTA) Stall Sent (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_STALL_SNT(value)         (UDPHS_EPTSTA_STALL_SNT_Msk & ((value) << UDPHS_EPTSTA_STALL_SNT_Pos))
#define UDPHS_EPTSTA_NAK_IN_Pos               _U_(14)                                              /**< (UDPHS_EPTSTA) NAK IN (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_NAK_IN_Msk               (_U_(0x1) << UDPHS_EPTSTA_NAK_IN_Pos)                /**< (UDPHS_EPTSTA) NAK IN (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_NAK_IN(value)            (UDPHS_EPTSTA_NAK_IN_Msk & ((value) << UDPHS_EPTSTA_NAK_IN_Pos))
#define UDPHS_EPTSTA_NAK_OUT_Pos              _U_(15)                                              /**< (UDPHS_EPTSTA) NAK OUT (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_NAK_OUT_Msk              (_U_(0x1) << UDPHS_EPTSTA_NAK_OUT_Pos)               /**< (UDPHS_EPTSTA) NAK OUT (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_NAK_OUT(value)           (UDPHS_EPTSTA_NAK_OUT_Msk & ((value) << UDPHS_EPTSTA_NAK_OUT_Pos))
#define UDPHS_EPTSTA_CURBK_CTLDIR_Pos         _U_(16)                                              /**< (UDPHS_EPTSTA) Current Bank/Control Direction (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_CURBK_CTLDIR_Msk         (_U_(0x3) << UDPHS_EPTSTA_CURBK_CTLDIR_Pos)          /**< (UDPHS_EPTSTA) Current Bank/Control Direction (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_CURBK_CTLDIR(value)      (UDPHS_EPTSTA_CURBK_CTLDIR_Msk & ((value) << UDPHS_EPTSTA_CURBK_CTLDIR_Pos))
#define UDPHS_EPTSTA_BUSY_BANK_STA_Pos        _U_(18)                                              /**< (UDPHS_EPTSTA) Busy Bank Number (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_BUSY_BANK_STA_Msk        (_U_(0x3) << UDPHS_EPTSTA_BUSY_BANK_STA_Pos)         /**< (UDPHS_EPTSTA) Busy Bank Number (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_BUSY_BANK_STA(value)     (UDPHS_EPTSTA_BUSY_BANK_STA_Msk & ((value) << UDPHS_EPTSTA_BUSY_BANK_STA_Pos))
#define   UDPHS_EPTSTA_BUSY_BANK_STA_0BUSYBANK_Val _U_(0x0)                                             /**< (UDPHS_EPTSTA) All banks are free  */
#define   UDPHS_EPTSTA_BUSY_BANK_STA_1BUSYBANK_Val _U_(0x1)                                             /**< (UDPHS_EPTSTA) 1 busy bank  */
#define   UDPHS_EPTSTA_BUSY_BANK_STA_2BUSYBANKS_Val _U_(0x2)                                             /**< (UDPHS_EPTSTA) 2 busy banks  */
#define   UDPHS_EPTSTA_BUSY_BANK_STA_3BUSYBANKS_Val _U_(0x3)                                             /**< (UDPHS_EPTSTA) 3 busy banks  */
#define UDPHS_EPTSTA_BUSY_BANK_STA_0BUSYBANK  (UDPHS_EPTSTA_BUSY_BANK_STA_0BUSYBANK_Val << UDPHS_EPTSTA_BUSY_BANK_STA_Pos) /**< (UDPHS_EPTSTA) All banks are free Position  */
#define UDPHS_EPTSTA_BUSY_BANK_STA_1BUSYBANK  (UDPHS_EPTSTA_BUSY_BANK_STA_1BUSYBANK_Val << UDPHS_EPTSTA_BUSY_BANK_STA_Pos) /**< (UDPHS_EPTSTA) 1 busy bank Position  */
#define UDPHS_EPTSTA_BUSY_BANK_STA_2BUSYBANKS (UDPHS_EPTSTA_BUSY_BANK_STA_2BUSYBANKS_Val << UDPHS_EPTSTA_BUSY_BANK_STA_Pos) /**< (UDPHS_EPTSTA) 2 busy banks Position  */
#define UDPHS_EPTSTA_BUSY_BANK_STA_3BUSYBANKS (UDPHS_EPTSTA_BUSY_BANK_STA_3BUSYBANKS_Val << UDPHS_EPTSTA_BUSY_BANK_STA_Pos) /**< (UDPHS_EPTSTA) 3 busy banks Position  */
#define UDPHS_EPTSTA_BYTE_COUNT_Pos           _U_(20)                                              /**< (UDPHS_EPTSTA) UDPHS Byte Count (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_BYTE_COUNT_Msk           (_U_(0x7FF) << UDPHS_EPTSTA_BYTE_COUNT_Pos)          /**< (UDPHS_EPTSTA) UDPHS Byte Count (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_BYTE_COUNT(value)        (UDPHS_EPTSTA_BYTE_COUNT_Msk & ((value) << UDPHS_EPTSTA_BYTE_COUNT_Pos))
#define UDPHS_EPTSTA_SHRT_PCKT_Pos            _U_(31)                                              /**< (UDPHS_EPTSTA) Short Packet (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_SHRT_PCKT_Msk            (_U_(0x1) << UDPHS_EPTSTA_SHRT_PCKT_Pos)             /**< (UDPHS_EPTSTA) Short Packet (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_SHRT_PCKT(value)         (UDPHS_EPTSTA_SHRT_PCKT_Msk & ((value) << UDPHS_EPTSTA_SHRT_PCKT_Pos))
#define UDPHS_EPTSTA_Msk                      _U_(0xFFFFFFE0)                                      /**< (UDPHS_EPTSTA) Register Mask  */

