Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/udphs.h
/* ISOENDPT mode */
#define UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_Pos _U_(6)                                               /**< (UDPHS_EPTSTA) Toggle Sequencing (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_Msk (_U_(0x3) << UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_Pos) /**< (UDPHS_EPTSTA) Toggle Sequencing (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA(value) (UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_Pos))
#define   UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_DATA0_Val _U_(0x0)                                             /**< (UDPHS_EPTSTA) DATA0  */
#define   UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_DATA1_Val _U_(0x1)                                             /**< (UDPHS_EPTSTA) DATA1  */
#define   UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_DATA2_Val _U_(0x2)                                             /**< (UDPHS_EPTSTA) Data2 (only for High Bandwidth Isochronous Endpoint)  */
#define   UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_MDATA_Val _U_(0x3)                                             /**< (UDPHS_EPTSTA) MData (only for High Bandwidth Isochronous Endpoint)  */
#define UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_DATA0 (UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_DATA0_Val << UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_Pos) /**< (UDPHS_EPTSTA) DATA0 Position  */
#define UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_DATA1 (UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_DATA1_Val << UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_Pos) /**< (UDPHS_EPTSTA) DATA1 Position  */
#define UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_DATA2 (UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_DATA2_Val << UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_Pos) /**< (UDPHS_EPTSTA) Data2 (only for High Bandwidth Isochronous Endpoint) Position  */
#define UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_MDATA (UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_MDATA_Val << UDPHS_EPTSTA_ISOENDPT_TOGGLESQ_STA_Pos) /**< (UDPHS_EPTSTA) MData (only for High Bandwidth Isochronous Endpoint) Position  */
#define UDPHS_EPTSTA_ISOENDPT_ERR_OVFLW_Pos   _U_(8)                                               /**< (UDPHS_EPTSTA) Overflow Error (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_ERR_OVFLW_Msk   (_U_(0x1) << UDPHS_EPTSTA_ISOENDPT_ERR_OVFLW_Pos)    /**< (UDPHS_EPTSTA) Overflow Error (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_ERR_OVFLW(value) (UDPHS_EPTSTA_ISOENDPT_ERR_OVFLW_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_ERR_OVFLW_Pos))
#define UDPHS_EPTSTA_ISOENDPT_RXRDY_TXKL_Pos  _U_(9)                                               /**< (UDPHS_EPTSTA) Received OUT Data/KILL Bank (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_RXRDY_TXKL_Msk  (_U_(0x1) << UDPHS_EPTSTA_ISOENDPT_RXRDY_TXKL_Pos)   /**< (UDPHS_EPTSTA) Received OUT Data/KILL Bank (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_RXRDY_TXKL(value) (UDPHS_EPTSTA_ISOENDPT_RXRDY_TXKL_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_RXRDY_TXKL_Pos))
#define UDPHS_EPTSTA_ISOENDPT_TX_COMPLT_Pos   _U_(10)                                              /**< (UDPHS_EPTSTA) Transmitted IN Data Complete (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_TX_COMPLT_Msk   (_U_(0x1) << UDPHS_EPTSTA_ISOENDPT_TX_COMPLT_Pos)    /**< (UDPHS_EPTSTA) Transmitted IN Data Complete (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_TX_COMPLT(value) (UDPHS_EPTSTA_ISOENDPT_TX_COMPLT_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_TX_COMPLT_Pos))
#define UDPHS_EPTSTA_ISOENDPT_TXRDY_TRER_Pos  _U_(11)                                              /**< (UDPHS_EPTSTA) TX Packet Ready/Transaction Error (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_TXRDY_TRER_Msk  (_U_(0x1) << UDPHS_EPTSTA_ISOENDPT_TXRDY_TRER_Pos)   /**< (UDPHS_EPTSTA) TX Packet Ready/Transaction Error (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_TXRDY_TRER(value) (UDPHS_EPTSTA_ISOENDPT_TXRDY_TRER_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_TXRDY_TRER_Pos))
#define UDPHS_EPTSTA_ISOENDPT_ERR_FL_ISO_Pos  _U_(12)                                              /**< (UDPHS_EPTSTA) Error Flow (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_ERR_FL_ISO_Msk  (_U_(0x1) << UDPHS_EPTSTA_ISOENDPT_ERR_FL_ISO_Pos)   /**< (UDPHS_EPTSTA) Error Flow (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_ERR_FL_ISO(value) (UDPHS_EPTSTA_ISOENDPT_ERR_FL_ISO_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_ERR_FL_ISO_Pos))
#define UDPHS_EPTSTA_ISOENDPT_ERR_CRC_NTR_Pos _U_(13)                                              /**< (UDPHS_EPTSTA) CRC ISO Error/Number of Transaction Error (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_ERR_CRC_NTR_Msk (_U_(0x1) << UDPHS_EPTSTA_ISOENDPT_ERR_CRC_NTR_Pos)  /**< (UDPHS_EPTSTA) CRC ISO Error/Number of Transaction Error (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_ERR_CRC_NTR(value) (UDPHS_EPTSTA_ISOENDPT_ERR_CRC_NTR_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_ERR_CRC_NTR_Pos))
#define UDPHS_EPTSTA_ISOENDPT_ERR_FLUSH_Pos   _U_(14)                                              /**< (UDPHS_EPTSTA) Bank Flush Error (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_ERR_FLUSH_Msk   (_U_(0x1) << UDPHS_EPTSTA_ISOENDPT_ERR_FLUSH_Pos)    /**< (UDPHS_EPTSTA) Bank Flush Error (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_ERR_FLUSH(value) (UDPHS_EPTSTA_ISOENDPT_ERR_FLUSH_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_ERR_FLUSH_Pos))
#define UDPHS_EPTSTA_ISOENDPT_CURBK_Pos       _U_(16)                                              /**< (UDPHS_EPTSTA) Current Bank (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_CURBK_Msk       (_U_(0x3) << UDPHS_EPTSTA_ISOENDPT_CURBK_Pos)        /**< (UDPHS_EPTSTA) Current Bank (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_CURBK(value)    (UDPHS_EPTSTA_ISOENDPT_CURBK_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_CURBK_Pos))
#define   UDPHS_EPTSTA_ISOENDPT_CURBK_BANK0_Val _U_(0x0)                                             /**< (UDPHS_EPTSTA) Bank 0 (or single bank)  */
#define   UDPHS_EPTSTA_ISOENDPT_CURBK_BANK1_Val _U_(0x1)                                             /**< (UDPHS_EPTSTA) Bank 1  */
#define   UDPHS_EPTSTA_ISOENDPT_CURBK_BANK2_Val _U_(0x2)                                             /**< (UDPHS_EPTSTA) Bank 2  */
#define UDPHS_EPTSTA_ISOENDPT_CURBK_BANK0     (UDPHS_EPTSTA_ISOENDPT_CURBK_BANK0_Val << UDPHS_EPTSTA_ISOENDPT_CURBK_Pos) /**< (UDPHS_EPTSTA) Bank 0 (or single bank) Position  */
#define UDPHS_EPTSTA_ISOENDPT_CURBK_BANK1     (UDPHS_EPTSTA_ISOENDPT_CURBK_BANK1_Val << UDPHS_EPTSTA_ISOENDPT_CURBK_Pos) /**< (UDPHS_EPTSTA) Bank 1 Position  */
#define UDPHS_EPTSTA_ISOENDPT_CURBK_BANK2     (UDPHS_EPTSTA_ISOENDPT_CURBK_BANK2_Val << UDPHS_EPTSTA_ISOENDPT_CURBK_Pos) /**< (UDPHS_EPTSTA) Bank 2 Position  */
#define UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_Pos _U_(18)                                              /**< (UDPHS_EPTSTA) Busy Bank Number (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_Msk (_U_(0x3) << UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_Pos) /**< (UDPHS_EPTSTA) Busy Bank Number (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA(value) (UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_Pos))
#define   UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_0BUSYBANK_Val _U_(0x0)                                             /**< (UDPHS_EPTSTA) All banks are free  */
#define   UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_1BUSYBANK_Val _U_(0x1)                                             /**< (UDPHS_EPTSTA) 1 busy bank  */
#define   UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_2BUSYBANKS_Val _U_(0x2)                                             /**< (UDPHS_EPTSTA) 2 busy banks  */
#define   UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_3BUSYBANKS_Val _U_(0x3)                                             /**< (UDPHS_EPTSTA) 3 busy banks  */
#define UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_0BUSYBANK (UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_0BUSYBANK_Val << UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_Pos) /**< (UDPHS_EPTSTA) All banks are free Position  */
#define UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_1BUSYBANK (UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_1BUSYBANK_Val << UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_Pos) /**< (UDPHS_EPTSTA) 1 busy bank Position  */
#define UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_2BUSYBANKS (UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_2BUSYBANKS_Val << UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_Pos) /**< (UDPHS_EPTSTA) 2 busy banks Position  */
#define UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_3BUSYBANKS (UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_3BUSYBANKS_Val << UDPHS_EPTSTA_ISOENDPT_BUSY_BANK_STA_Pos) /**< (UDPHS_EPTSTA) 3 busy banks Position  */
#define UDPHS_EPTSTA_ISOENDPT_BYTE_COUNT_Pos  _U_(20)                                              /**< (UDPHS_EPTSTA) UDPHS Byte Count (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_BYTE_COUNT_Msk  (_U_(0x7FF) << UDPHS_EPTSTA_ISOENDPT_BYTE_COUNT_Pos) /**< (UDPHS_EPTSTA) UDPHS Byte Count (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_BYTE_COUNT(value) (UDPHS_EPTSTA_ISOENDPT_BYTE_COUNT_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_BYTE_COUNT_Pos))
#define UDPHS_EPTSTA_ISOENDPT_SHRT_PCKT_Pos   _U_(31)                                              /**< (UDPHS_EPTSTA) Short Packet (cleared upon USB reset) Position */
#define UDPHS_EPTSTA_ISOENDPT_SHRT_PCKT_Msk   (_U_(0x1) << UDPHS_EPTSTA_ISOENDPT_SHRT_PCKT_Pos)    /**< (UDPHS_EPTSTA) Short Packet (cleared upon USB reset) Mask */
#define UDPHS_EPTSTA_ISOENDPT_SHRT_PCKT(value) (UDPHS_EPTSTA_ISOENDPT_SHRT_PCKT_Msk & ((value) << UDPHS_EPTSTA_ISOENDPT_SHRT_PCKT_Pos))
#define UDPHS_EPTSTA_ISOENDPT_Msk             _U_(0xFFFF7FC0)                                       /**< (UDPHS_EPTSTA_ISOENDPT) Register Mask  */


