Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/udphs.h
/* -------- UDPHS_CTRL : (UDPHS Offset: 0x00) (R/W 32) UDPHS Control Register -------- */
#define UDPHS_CTRL_DEV_ADDR_Pos               _U_(0)                                               /**< (UDPHS_CTRL) UDPHS Address (cleared upon USB reset) Position */
#define UDPHS_CTRL_DEV_ADDR_Msk               (_U_(0x7F) << UDPHS_CTRL_DEV_ADDR_Pos)               /**< (UDPHS_CTRL) UDPHS Address (cleared upon USB reset) Mask */
#define UDPHS_CTRL_DEV_ADDR(value)            (UDPHS_CTRL_DEV_ADDR_Msk & ((value) << UDPHS_CTRL_DEV_ADDR_Pos))
#define UDPHS_CTRL_FADDR_EN_Pos               _U_(7)                                               /**< (UDPHS_CTRL) Function Address Enable (cleared upon USB reset) Position */
#define UDPHS_CTRL_FADDR_EN_Msk               (_U_(0x1) << UDPHS_CTRL_FADDR_EN_Pos)                /**< (UDPHS_CTRL) Function Address Enable (cleared upon USB reset) Mask */
#define UDPHS_CTRL_FADDR_EN(value)            (UDPHS_CTRL_FADDR_EN_Msk & ((value) << UDPHS_CTRL_FADDR_EN_Pos))
#define UDPHS_CTRL_EN_UDPHS_Pos               _U_(8)                                               /**< (UDPHS_CTRL) UDPHS Enable Position */
#define UDPHS_CTRL_EN_UDPHS_Msk               (_U_(0x1) << UDPHS_CTRL_EN_UDPHS_Pos)                /**< (UDPHS_CTRL) UDPHS Enable Mask */
#define UDPHS_CTRL_EN_UDPHS(value)            (UDPHS_CTRL_EN_UDPHS_Msk & ((value) << UDPHS_CTRL_EN_UDPHS_Pos))
#define UDPHS_CTRL_DETACH_Pos                 _U_(9)                                               /**< (UDPHS_CTRL) Detach Command Position */
#define UDPHS_CTRL_DETACH_Msk                 (_U_(0x1) << UDPHS_CTRL_DETACH_Pos)                  /**< (UDPHS_CTRL) Detach Command Mask */
#define UDPHS_CTRL_DETACH(value)              (UDPHS_CTRL_DETACH_Msk & ((value) << UDPHS_CTRL_DETACH_Pos))
#define UDPHS_CTRL_REWAKEUP_Pos               _U_(10)                                              /**< (UDPHS_CTRL) Send Remote Wakeup (cleared upon USB reset) Position */
#define UDPHS_CTRL_REWAKEUP_Msk               (_U_(0x1) << UDPHS_CTRL_REWAKEUP_Pos)                /**< (UDPHS_CTRL) Send Remote Wakeup (cleared upon USB reset) Mask */
#define UDPHS_CTRL_REWAKEUP(value)            (UDPHS_CTRL_REWAKEUP_Msk & ((value) << UDPHS_CTRL_REWAKEUP_Pos))
#define UDPHS_CTRL_PULLD_DIS_Pos              _U_(11)                                              /**< (UDPHS_CTRL) Pulldown Disable (cleared upon USB reset) Position */
#define UDPHS_CTRL_PULLD_DIS_Msk              (_U_(0x1) << UDPHS_CTRL_PULLD_DIS_Pos)               /**< (UDPHS_CTRL) Pulldown Disable (cleared upon USB reset) Mask */
#define UDPHS_CTRL_PULLD_DIS(value)           (UDPHS_CTRL_PULLD_DIS_Msk & ((value) << UDPHS_CTRL_PULLD_DIS_Pos))
#define UDPHS_CTRL_Msk                        _U_(0x00000FFF)                                      /**< (UDPHS_CTRL) Register Mask  */


/* -------- UDPHS_FNUM : (UDPHS Offset: 0x04) ( R/ 32) UDPHS Frame Number Register -------- */
#define UDPHS_FNUM_MICRO_FRAME_NUM_Pos        _U_(0)                                               /**< (UDPHS_FNUM) Microframe Number (cleared upon USB reset) Position */
#define UDPHS_FNUM_MICRO_FRAME_NUM_Msk        (_U_(0x7) << UDPHS_FNUM_MICRO_FRAME_NUM_Pos)         /**< (UDPHS_FNUM) Microframe Number (cleared upon USB reset) Mask */
#define UDPHS_FNUM_MICRO_FRAME_NUM(value)     (UDPHS_FNUM_MICRO_FRAME_NUM_Msk & ((value) << UDPHS_FNUM_MICRO_FRAME_NUM_Pos))
#define UDPHS_FNUM_FRAME_NUMBER_Pos           _U_(3)                                               /**< (UDPHS_FNUM) Frame Number as defined in the Packet Field Formats (cleared upon USB reset) Position */
#define UDPHS_FNUM_FRAME_NUMBER_Msk           (_U_(0x7FF) << UDPHS_FNUM_FRAME_NUMBER_Pos)          /**< (UDPHS_FNUM) Frame Number as defined in the Packet Field Formats (cleared upon USB reset) Mask */
#define UDPHS_FNUM_FRAME_NUMBER(value)        (UDPHS_FNUM_FRAME_NUMBER_Msk & ((value) << UDPHS_FNUM_FRAME_NUMBER_Pos))
#define UDPHS_FNUM_FNUM_ERR_Pos               _U_(31)                                              /**< (UDPHS_FNUM) Frame Number CRC Error (cleared upon USB reset) Position */
#define UDPHS_FNUM_FNUM_ERR_Msk               (_U_(0x1) << UDPHS_FNUM_FNUM_ERR_Pos)                /**< (UDPHS_FNUM) Frame Number CRC Error (cleared upon USB reset) Mask */
#define UDPHS_FNUM_FNUM_ERR(value)            (UDPHS_FNUM_FNUM_ERR_Msk & ((value) << UDPHS_FNUM_FNUM_ERR_Pos))
#define UDPHS_FNUM_Msk                        _U_(0x80003FFF)                                      /**< (UDPHS_FNUM) Register Mask  */


/* -------- UDPHS_IEN : (UDPHS Offset: 0x10) (R/W 32) UDPHS Interrupt Enable Register -------- */
#define UDPHS_IEN_DET_SUSPD_Pos               _U_(1)                                               /**< (UDPHS_IEN) Suspend Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DET_SUSPD_Msk               (_U_(0x1) << UDPHS_IEN_DET_SUSPD_Pos)                /**< (UDPHS_IEN) Suspend Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DET_SUSPD(value)            (UDPHS_IEN_DET_SUSPD_Msk & ((value) << UDPHS_IEN_DET_SUSPD_Pos))
#define UDPHS_IEN_MICRO_SOF_Pos               _U_(2)                                               /**< (UDPHS_IEN) Micro-SOF Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_MICRO_SOF_Msk               (_U_(0x1) << UDPHS_IEN_MICRO_SOF_Pos)                /**< (UDPHS_IEN) Micro-SOF Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_MICRO_SOF(value)            (UDPHS_IEN_MICRO_SOF_Msk & ((value) << UDPHS_IEN_MICRO_SOF_Pos))
#define UDPHS_IEN_INT_SOF_Pos                 _U_(3)                                               /**< (UDPHS_IEN) SOF Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_INT_SOF_Msk                 (_U_(0x1) << UDPHS_IEN_INT_SOF_Pos)                  /**< (UDPHS_IEN) SOF Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_INT_SOF(value)              (UDPHS_IEN_INT_SOF_Msk & ((value) << UDPHS_IEN_INT_SOF_Pos))
#define UDPHS_IEN_ENDRESET_Pos                _U_(4)                                               /**< (UDPHS_IEN) End Of Reset Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_ENDRESET_Msk                (_U_(0x1) << UDPHS_IEN_ENDRESET_Pos)                 /**< (UDPHS_IEN) End Of Reset Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_ENDRESET(value)             (UDPHS_IEN_ENDRESET_Msk & ((value) << UDPHS_IEN_ENDRESET_Pos))
#define UDPHS_IEN_WAKE_UP_Pos                 _U_(5)                                               /**< (UDPHS_IEN) Wake Up CPU Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_WAKE_UP_Msk                 (_U_(0x1) << UDPHS_IEN_WAKE_UP_Pos)                  /**< (UDPHS_IEN) Wake Up CPU Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_WAKE_UP(value)              (UDPHS_IEN_WAKE_UP_Msk & ((value) << UDPHS_IEN_WAKE_UP_Pos))
#define UDPHS_IEN_ENDOFRSM_Pos                _U_(6)                                               /**< (UDPHS_IEN) End Of Resume Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_ENDOFRSM_Msk                (_U_(0x1) << UDPHS_IEN_ENDOFRSM_Pos)                 /**< (UDPHS_IEN) End Of Resume Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_ENDOFRSM(value)             (UDPHS_IEN_ENDOFRSM_Msk & ((value) << UDPHS_IEN_ENDOFRSM_Pos))
#define UDPHS_IEN_UPSTR_RES_Pos               _U_(7)                                               /**< (UDPHS_IEN) Upstream Resume Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_UPSTR_RES_Msk               (_U_(0x1) << UDPHS_IEN_UPSTR_RES_Pos)                /**< (UDPHS_IEN) Upstream Resume Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_UPSTR_RES(value)            (UDPHS_IEN_UPSTR_RES_Msk & ((value) << UDPHS_IEN_UPSTR_RES_Pos))
#define UDPHS_IEN_EPT_0_Pos                   _U_(8)                                               /**< (UDPHS_IEN) Endpoint 0 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_0_Msk                   (_U_(0x1) << UDPHS_IEN_EPT_0_Pos)                    /**< (UDPHS_IEN) Endpoint 0 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_0(value)                (UDPHS_IEN_EPT_0_Msk & ((value) << UDPHS_IEN_EPT_0_Pos))
#define UDPHS_IEN_EPT_1_Pos                   _U_(9)                                               /**< (UDPHS_IEN) Endpoint 1 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_1_Msk                   (_U_(0x1) << UDPHS_IEN_EPT_1_Pos)                    /**< (UDPHS_IEN) Endpoint 1 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_1(value)                (UDPHS_IEN_EPT_1_Msk & ((value) << UDPHS_IEN_EPT_1_Pos))
#define UDPHS_IEN_EPT_2_Pos                   _U_(10)                                              /**< (UDPHS_IEN) Endpoint 2 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_2_Msk                   (_U_(0x1) << UDPHS_IEN_EPT_2_Pos)                    /**< (UDPHS_IEN) Endpoint 2 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_2(value)                (UDPHS_IEN_EPT_2_Msk & ((value) << UDPHS_IEN_EPT_2_Pos))
#define UDPHS_IEN_EPT_3_Pos                   _U_(11)                                              /**< (UDPHS_IEN) Endpoint 3 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_3_Msk                   (_U_(0x1) << UDPHS_IEN_EPT_3_Pos)                    /**< (UDPHS_IEN) Endpoint 3 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_3(value)                (UDPHS_IEN_EPT_3_Msk & ((value) << UDPHS_IEN_EPT_3_Pos))
#define UDPHS_IEN_EPT_4_Pos                   _U_(12)                                              /**< (UDPHS_IEN) Endpoint 4 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_4_Msk                   (_U_(0x1) << UDPHS_IEN_EPT_4_Pos)                    /**< (UDPHS_IEN) Endpoint 4 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_4(value)                (UDPHS_IEN_EPT_4_Msk & ((value) << UDPHS_IEN_EPT_4_Pos))
#define UDPHS_IEN_EPT_5_Pos                   _U_(13)                                              /**< (UDPHS_IEN) Endpoint 5 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_5_Msk                   (_U_(0x1) << UDPHS_IEN_EPT_5_Pos)                    /**< (UDPHS_IEN) Endpoint 5 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_5(value)                (UDPHS_IEN_EPT_5_Msk & ((value) << UDPHS_IEN_EPT_5_Pos))
#define UDPHS_IEN_EPT_6_Pos                   _U_(14)                                              /**< (UDPHS_IEN) Endpoint 6 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_6_Msk                   (_U_(0x1) << UDPHS_IEN_EPT_6_Pos)                    /**< (UDPHS_IEN) Endpoint 6 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_6(value)                (UDPHS_IEN_EPT_6_Msk & ((value) << UDPHS_IEN_EPT_6_Pos))
#define UDPHS_IEN_DMA_1_Pos                   _U_(25)                                              /**< (UDPHS_IEN) DMA Channel 1 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_1_Msk                   (_U_(0x1) << UDPHS_IEN_DMA_1_Pos)                    /**< (UDPHS_IEN) DMA Channel 1 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_1(value)                (UDPHS_IEN_DMA_1_Msk & ((value) << UDPHS_IEN_DMA_1_Pos))
#define UDPHS_IEN_DMA_2_Pos                   _U_(26)                                              /**< (UDPHS_IEN) DMA Channel 2 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_2_Msk                   (_U_(0x1) << UDPHS_IEN_DMA_2_Pos)                    /**< (UDPHS_IEN) DMA Channel 2 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_2(value)                (UDPHS_IEN_DMA_2_Msk & ((value) << UDPHS_IEN_DMA_2_Pos))
#define UDPHS_IEN_DMA_3_Pos                   _U_(27)                                              /**< (UDPHS_IEN) DMA Channel 3 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_3_Msk                   (_U_(0x1) << UDPHS_IEN_DMA_3_Pos)                    /**< (UDPHS_IEN) DMA Channel 3 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_3(value)                (UDPHS_IEN_DMA_3_Msk & ((value) << UDPHS_IEN_DMA_3_Pos))
#define UDPHS_IEN_DMA_4_Pos                   _U_(28)                                              /**< (UDPHS_IEN) DMA Channel 4 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_4_Msk                   (_U_(0x1) << UDPHS_IEN_DMA_4_Pos)                    /**< (UDPHS_IEN) DMA Channel 4 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_4(value)                (UDPHS_IEN_DMA_4_Msk & ((value) << UDPHS_IEN_DMA_4_Pos))
#define UDPHS_IEN_DMA_5_Pos                   _U_(29)                                              /**< (UDPHS_IEN) DMA Channel 5 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_5_Msk                   (_U_(0x1) << UDPHS_IEN_DMA_5_Pos)                    /**< (UDPHS_IEN) DMA Channel 5 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_5(value)                (UDPHS_IEN_DMA_5_Msk & ((value) << UDPHS_IEN_DMA_5_Pos))
#define UDPHS_IEN_DMA_6_Pos                   _U_(30)                                              /**< (UDPHS_IEN) DMA Channel 6 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_6_Msk                   (_U_(0x1) << UDPHS_IEN_DMA_6_Pos)                    /**< (UDPHS_IEN) DMA Channel 6 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_6(value)                (UDPHS_IEN_DMA_6_Msk & ((value) << UDPHS_IEN_DMA_6_Pos))
#define UDPHS_IEN_Msk                         _U_(0x7E007FFE)                                      /**< (UDPHS_IEN) Register Mask  */

