Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/udphs.h
/* -------- UDPHS_CLRINT : (UDPHS Offset: 0x18) ( /W 32) UDPHS Clear Interrupt Register -------- */
#define UDPHS_CLRINT_DET_SUSPD_Pos            _U_(1)                                               /**< (UDPHS_CLRINT) Suspend Interrupt Clear Position */
#define UDPHS_CLRINT_DET_SUSPD_Msk            (_U_(0x1) << UDPHS_CLRINT_DET_SUSPD_Pos)             /**< (UDPHS_CLRINT) Suspend Interrupt Clear Mask */
#define UDPHS_CLRINT_DET_SUSPD(value)         (UDPHS_CLRINT_DET_SUSPD_Msk & ((value) << UDPHS_CLRINT_DET_SUSPD_Pos))
#define UDPHS_CLRINT_MICRO_SOF_Pos            _U_(2)                                               /**< (UDPHS_CLRINT) Micro Start Of Frame Interrupt Clear Position */
#define UDPHS_CLRINT_MICRO_SOF_Msk            (_U_(0x1) << UDPHS_CLRINT_MICRO_SOF_Pos)             /**< (UDPHS_CLRINT) Micro Start Of Frame Interrupt Clear Mask */
#define UDPHS_CLRINT_MICRO_SOF(value)         (UDPHS_CLRINT_MICRO_SOF_Msk & ((value) << UDPHS_CLRINT_MICRO_SOF_Pos))
#define UDPHS_CLRINT_INT_SOF_Pos              _U_(3)                                               /**< (UDPHS_CLRINT) Start Of Frame Interrupt Clear Position */
#define UDPHS_CLRINT_INT_SOF_Msk              (_U_(0x1) << UDPHS_CLRINT_INT_SOF_Pos)               /**< (UDPHS_CLRINT) Start Of Frame Interrupt Clear Mask */
#define UDPHS_CLRINT_INT_SOF(value)           (UDPHS_CLRINT_INT_SOF_Msk & ((value) << UDPHS_CLRINT_INT_SOF_Pos))
#define UDPHS_CLRINT_ENDRESET_Pos             _U_(4)                                               /**< (UDPHS_CLRINT) End Of Reset Interrupt Clear Position */
#define UDPHS_CLRINT_ENDRESET_Msk             (_U_(0x1) << UDPHS_CLRINT_ENDRESET_Pos)              /**< (UDPHS_CLRINT) End Of Reset Interrupt Clear Mask */
#define UDPHS_CLRINT_ENDRESET(value)          (UDPHS_CLRINT_ENDRESET_Msk & ((value) << UDPHS_CLRINT_ENDRESET_Pos))
#define UDPHS_CLRINT_WAKE_UP_Pos              _U_(5)                                               /**< (UDPHS_CLRINT) Wake Up CPU Interrupt Clear Position */
#define UDPHS_CLRINT_WAKE_UP_Msk              (_U_(0x1) << UDPHS_CLRINT_WAKE_UP_Pos)               /**< (UDPHS_CLRINT) Wake Up CPU Interrupt Clear Mask */
#define UDPHS_CLRINT_WAKE_UP(value)           (UDPHS_CLRINT_WAKE_UP_Msk & ((value) << UDPHS_CLRINT_WAKE_UP_Pos))
#define UDPHS_CLRINT_ENDOFRSM_Pos             _U_(6)                                               /**< (UDPHS_CLRINT) End Of Resume Interrupt Clear Position */
#define UDPHS_CLRINT_ENDOFRSM_Msk             (_U_(0x1) << UDPHS_CLRINT_ENDOFRSM_Pos)              /**< (UDPHS_CLRINT) End Of Resume Interrupt Clear Mask */
#define UDPHS_CLRINT_ENDOFRSM(value)          (UDPHS_CLRINT_ENDOFRSM_Msk & ((value) << UDPHS_CLRINT_ENDOFRSM_Pos))
#define UDPHS_CLRINT_UPSTR_RES_Pos            _U_(7)                                               /**< (UDPHS_CLRINT) Upstream Resume Interrupt Clear Position */
#define UDPHS_CLRINT_UPSTR_RES_Msk            (_U_(0x1) << UDPHS_CLRINT_UPSTR_RES_Pos)             /**< (UDPHS_CLRINT) Upstream Resume Interrupt Clear Mask */
#define UDPHS_CLRINT_UPSTR_RES(value)         (UDPHS_CLRINT_UPSTR_RES_Msk & ((value) << UDPHS_CLRINT_UPSTR_RES_Pos))
#define UDPHS_CLRINT_Msk                      _U_(0x000000FE)                                      /**< (UDPHS_CLRINT) Register Mask  */


/* -------- UDPHS_EPTRST : (UDPHS Offset: 0x1C) ( /W 32) UDPHS Endpoints Reset Register -------- */
#define UDPHS_EPTRST_EPT_0_Pos                _U_(0)                                               /**< (UDPHS_EPTRST) Endpoint 0 Reset Position */
#define UDPHS_EPTRST_EPT_0_Msk                (_U_(0x1) << UDPHS_EPTRST_EPT_0_Pos)                 /**< (UDPHS_EPTRST) Endpoint 0 Reset Mask */
#define UDPHS_EPTRST_EPT_0(value)             (UDPHS_EPTRST_EPT_0_Msk & ((value) << UDPHS_EPTRST_EPT_0_Pos))
#define UDPHS_EPTRST_EPT_1_Pos                _U_(1)                                               /**< (UDPHS_EPTRST) Endpoint 1 Reset Position */
#define UDPHS_EPTRST_EPT_1_Msk                (_U_(0x1) << UDPHS_EPTRST_EPT_1_Pos)                 /**< (UDPHS_EPTRST) Endpoint 1 Reset Mask */
#define UDPHS_EPTRST_EPT_1(value)             (UDPHS_EPTRST_EPT_1_Msk & ((value) << UDPHS_EPTRST_EPT_1_Pos))
#define UDPHS_EPTRST_EPT_2_Pos                _U_(2)                                               /**< (UDPHS_EPTRST) Endpoint 2 Reset Position */
#define UDPHS_EPTRST_EPT_2_Msk                (_U_(0x1) << UDPHS_EPTRST_EPT_2_Pos)                 /**< (UDPHS_EPTRST) Endpoint 2 Reset Mask */
#define UDPHS_EPTRST_EPT_2(value)             (UDPHS_EPTRST_EPT_2_Msk & ((value) << UDPHS_EPTRST_EPT_2_Pos))
#define UDPHS_EPTRST_EPT_3_Pos                _U_(3)                                               /**< (UDPHS_EPTRST) Endpoint 3 Reset Position */
#define UDPHS_EPTRST_EPT_3_Msk                (_U_(0x1) << UDPHS_EPTRST_EPT_3_Pos)                 /**< (UDPHS_EPTRST) Endpoint 3 Reset Mask */
#define UDPHS_EPTRST_EPT_3(value)             (UDPHS_EPTRST_EPT_3_Msk & ((value) << UDPHS_EPTRST_EPT_3_Pos))
#define UDPHS_EPTRST_EPT_4_Pos                _U_(4)                                               /**< (UDPHS_EPTRST) Endpoint 4 Reset Position */
#define UDPHS_EPTRST_EPT_4_Msk                (_U_(0x1) << UDPHS_EPTRST_EPT_4_Pos)                 /**< (UDPHS_EPTRST) Endpoint 4 Reset Mask */
#define UDPHS_EPTRST_EPT_4(value)             (UDPHS_EPTRST_EPT_4_Msk & ((value) << UDPHS_EPTRST_EPT_4_Pos))
#define UDPHS_EPTRST_EPT_5_Pos                _U_(5)                                               /**< (UDPHS_EPTRST) Endpoint 5 Reset Position */
#define UDPHS_EPTRST_EPT_5_Msk                (_U_(0x1) << UDPHS_EPTRST_EPT_5_Pos)                 /**< (UDPHS_EPTRST) Endpoint 5 Reset Mask */
#define UDPHS_EPTRST_EPT_5(value)             (UDPHS_EPTRST_EPT_5_Msk & ((value) << UDPHS_EPTRST_EPT_5_Pos))
#define UDPHS_EPTRST_EPT_6_Pos                _U_(6)                                               /**< (UDPHS_EPTRST) Endpoint 6 Reset Position */
#define UDPHS_EPTRST_EPT_6_Msk                (_U_(0x1) << UDPHS_EPTRST_EPT_6_Pos)                 /**< (UDPHS_EPTRST) Endpoint 6 Reset Mask */
#define UDPHS_EPTRST_EPT_6(value)             (UDPHS_EPTRST_EPT_6_Msk & ((value) << UDPHS_EPTRST_EPT_6_Pos))
#define UDPHS_EPTRST_Msk                      _U_(0x0000007F)                                      /**< (UDPHS_EPTRST) Register Mask  */

#define UDPHS_EPTRST_EPT__Pos                 _U_(0)                                               /**< (UDPHS_EPTRST Position) Endpoint 6 Reset */
#define UDPHS_EPTRST_EPT__Msk                 (_U_(0x7F) << UDPHS_EPTRST_EPT__Pos)                 /**< (UDPHS_EPTRST Mask) EPT_ */
#define UDPHS_EPTRST_EPT_(value)              (UDPHS_EPTRST_EPT__Msk & ((value) << UDPHS_EPTRST_EPT__Pos)) 

/* -------- UDPHS_TSTSOFCNT : (UDPHS Offset: 0xD0) (R/W 32) UDPHS Test SOF Counter Register -------- */
#define UDPHS_TSTSOFCNT_SOFCNTMAX_Pos         _U_(0)                                               /**< (UDPHS_TSTSOFCNT) SOF Counter Max Value Position */
#define UDPHS_TSTSOFCNT_SOFCNTMAX_Msk         (_U_(0x7F) << UDPHS_TSTSOFCNT_SOFCNTMAX_Pos)         /**< (UDPHS_TSTSOFCNT) SOF Counter Max Value Mask */
#define UDPHS_TSTSOFCNT_SOFCNTMAX(value)      (UDPHS_TSTSOFCNT_SOFCNTMAX_Msk & ((value) << UDPHS_TSTSOFCNT_SOFCNTMAX_Pos))
#define UDPHS_TSTSOFCNT_SOFCTLOAD_Pos         _U_(7)                                               /**< (UDPHS_TSTSOFCNT) SOF Counter Load Position */
#define UDPHS_TSTSOFCNT_SOFCTLOAD_Msk         (_U_(0x1) << UDPHS_TSTSOFCNT_SOFCTLOAD_Pos)          /**< (UDPHS_TSTSOFCNT) SOF Counter Load Mask */
#define UDPHS_TSTSOFCNT_SOFCTLOAD(value)      (UDPHS_TSTSOFCNT_SOFCTLOAD_Msk & ((value) << UDPHS_TSTSOFCNT_SOFCTLOAD_Pos))
#define UDPHS_TSTSOFCNT_Msk                   _U_(0x000000FF)                                      /**< (UDPHS_TSTSOFCNT) Register Mask  */


