Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/udphs.h
/* -------- UDPHS_TSTCNTA : (UDPHS Offset: 0xD4) (R/W 32) UDPHS Test A Counter Register -------- */
#define UDPHS_TSTCNTA_CNTAMAX_Pos             _U_(0)                                               /**< (UDPHS_TSTCNTA) A Counter Max Value Position */
#define UDPHS_TSTCNTA_CNTAMAX_Msk             (_U_(0x7FFF) << UDPHS_TSTCNTA_CNTAMAX_Pos)           /**< (UDPHS_TSTCNTA) A Counter Max Value Mask */
#define UDPHS_TSTCNTA_CNTAMAX(value)          (UDPHS_TSTCNTA_CNTAMAX_Msk & ((value) << UDPHS_TSTCNTA_CNTAMAX_Pos))
#define UDPHS_TSTCNTA_CNTALOAD_Pos            _U_(15)                                              /**< (UDPHS_TSTCNTA) A Counter Load Position */
#define UDPHS_TSTCNTA_CNTALOAD_Msk            (_U_(0x1) << UDPHS_TSTCNTA_CNTALOAD_Pos)             /**< (UDPHS_TSTCNTA) A Counter Load Mask */
#define UDPHS_TSTCNTA_CNTALOAD(value)         (UDPHS_TSTCNTA_CNTALOAD_Msk & ((value) << UDPHS_TSTCNTA_CNTALOAD_Pos))
#define UDPHS_TSTCNTA_Msk                     _U_(0x0000FFFF)                                      /**< (UDPHS_TSTCNTA) Register Mask  */


/* -------- UDPHS_TSTCNTB : (UDPHS Offset: 0xD8) (R/W 32) UDPHS Test B Counter Register -------- */
#define UDPHS_TSTCNTB_CNTBMAX_Pos             _U_(0)                                               /**< (UDPHS_TSTCNTB) B Counter Max Value Position */
#define UDPHS_TSTCNTB_CNTBMAX_Msk             (_U_(0x7FFF) << UDPHS_TSTCNTB_CNTBMAX_Pos)           /**< (UDPHS_TSTCNTB) B Counter Max Value Mask */
#define UDPHS_TSTCNTB_CNTBMAX(value)          (UDPHS_TSTCNTB_CNTBMAX_Msk & ((value) << UDPHS_TSTCNTB_CNTBMAX_Pos))
#define UDPHS_TSTCNTB_CNTBLOAD_Pos            _U_(15)                                              /**< (UDPHS_TSTCNTB) B Counter Load Position */
#define UDPHS_TSTCNTB_CNTBLOAD_Msk            (_U_(0x1) << UDPHS_TSTCNTB_CNTBLOAD_Pos)             /**< (UDPHS_TSTCNTB) B Counter Load Mask */
#define UDPHS_TSTCNTB_CNTBLOAD(value)         (UDPHS_TSTCNTB_CNTBLOAD_Msk & ((value) << UDPHS_TSTCNTB_CNTBLOAD_Pos))
#define UDPHS_TSTCNTB_Msk                     _U_(0x0000FFFF)                                      /**< (UDPHS_TSTCNTB) Register Mask  */


/* -------- UDPHS_TSTMODEREG : (UDPHS Offset: 0xDC) (R/W 32) UDPHS Test Mode Register -------- */
#define UDPHS_TSTMODEREG_TSTMODE_Pos          _U_(1)                                               /**< (UDPHS_TSTMODEREG) UDPHS Core TestModeReg Position */
#define UDPHS_TSTMODEREG_TSTMODE_Msk          (_U_(0x1F) << UDPHS_TSTMODEREG_TSTMODE_Pos)          /**< (UDPHS_TSTMODEREG) UDPHS Core TestModeReg Mask */
#define UDPHS_TSTMODEREG_TSTMODE(value)       (UDPHS_TSTMODEREG_TSTMODE_Msk & ((value) << UDPHS_TSTMODEREG_TSTMODE_Pos))
#define UDPHS_TSTMODEREG_Msk                  _U_(0x0000003E)                                      /**< (UDPHS_TSTMODEREG) Register Mask  */


/* -------- UDPHS_TST : (UDPHS Offset: 0xE0) (R/W 32) UDPHS Test Register -------- */
#define UDPHS_TST_SPEED_CFG_Pos               _U_(0)                                               /**< (UDPHS_TST) Speed Configuration Position */
#define UDPHS_TST_SPEED_CFG_Msk               (_U_(0x3) << UDPHS_TST_SPEED_CFG_Pos)                /**< (UDPHS_TST) Speed Configuration Mask */
#define UDPHS_TST_SPEED_CFG(value)            (UDPHS_TST_SPEED_CFG_Msk & ((value) << UDPHS_TST_SPEED_CFG_Pos))
#define   UDPHS_TST_SPEED_CFG_NORMAL_Val      _U_(0x0)                                             /**< (UDPHS_TST) Normal mode: The macro is in Full Speed mode, ready to make a High Speed identification, if the host supports it and then to automatically switch to High Speed mode.  */
#define   UDPHS_TST_SPEED_CFG_HIGH_SPEED_Val  _U_(0x2)                                             /**< (UDPHS_TST) Force High Speed: Set this value to force the hardware to work in High Speed mode. Only for debug or test purpose.  */
#define   UDPHS_TST_SPEED_CFG_FULL_SPEED_Val  _U_(0x3)                                             /**< (UDPHS_TST) Force Full Speed: Set this value to force the hardware to work only in Full Speed mode. In this configuration, the macro will not respond to a High Speed reset handshake.  */
#define UDPHS_TST_SPEED_CFG_NORMAL            (UDPHS_TST_SPEED_CFG_NORMAL_Val << UDPHS_TST_SPEED_CFG_Pos) /**< (UDPHS_TST) Normal mode: The macro is in Full Speed mode, ready to make a High Speed identification, if the host supports it and then to automatically switch to High Speed mode. Position  */
#define UDPHS_TST_SPEED_CFG_HIGH_SPEED        (UDPHS_TST_SPEED_CFG_HIGH_SPEED_Val << UDPHS_TST_SPEED_CFG_Pos) /**< (UDPHS_TST) Force High Speed: Set this value to force the hardware to work in High Speed mode. Only for debug or test purpose. Position  */
#define UDPHS_TST_SPEED_CFG_FULL_SPEED        (UDPHS_TST_SPEED_CFG_FULL_SPEED_Val << UDPHS_TST_SPEED_CFG_Pos) /**< (UDPHS_TST) Force Full Speed: Set this value to force the hardware to work only in Full Speed mode. In this configuration, the macro will not respond to a High Speed reset handshake. Position  */
#define UDPHS_TST_TST_J_Pos                   _U_(2)                                               /**< (UDPHS_TST) Test J Mode Position */
#define UDPHS_TST_TST_J_Msk                   (_U_(0x1) << UDPHS_TST_TST_J_Pos)                    /**< (UDPHS_TST) Test J Mode Mask */
#define UDPHS_TST_TST_J(value)                (UDPHS_TST_TST_J_Msk & ((value) << UDPHS_TST_TST_J_Pos))
#define UDPHS_TST_TST_K_Pos                   _U_(3)                                               /**< (UDPHS_TST) Test K Mode Position */
#define UDPHS_TST_TST_K_Msk                   (_U_(0x1) << UDPHS_TST_TST_K_Pos)                    /**< (UDPHS_TST) Test K Mode Mask */
#define UDPHS_TST_TST_K(value)                (UDPHS_TST_TST_K_Msk & ((value) << UDPHS_TST_TST_K_Pos))
#define UDPHS_TST_TST_PKT_Pos                 _U_(4)                                               /**< (UDPHS_TST) Test Packet Mode Position */
#define UDPHS_TST_TST_PKT_Msk                 (_U_(0x1) << UDPHS_TST_TST_PKT_Pos)                  /**< (UDPHS_TST) Test Packet Mode Mask */
#define UDPHS_TST_TST_PKT(value)              (UDPHS_TST_TST_PKT_Msk & ((value) << UDPHS_TST_TST_PKT_Pos))
#define UDPHS_TST_OPMODE2_Pos                 _U_(5)                                               /**< (UDPHS_TST) OpMode2 Position */
#define UDPHS_TST_OPMODE2_Msk                 (_U_(0x1) << UDPHS_TST_OPMODE2_Pos)                  /**< (UDPHS_TST) OpMode2 Mask */
#define UDPHS_TST_OPMODE2(value)              (UDPHS_TST_OPMODE2_Msk & ((value) << UDPHS_TST_OPMODE2_Pos))
#define UDPHS_TST_Msk                         _U_(0x0000003F)                                      /**< (UDPHS_TST) Register Mask  */

#define UDPHS_TST_OPMODE_Pos                  _U_(5)                                               /**< (UDPHS_TST Position) OpMode2 */
#define UDPHS_TST_OPMODE_Msk                  (_U_(0x1) << UDPHS_TST_OPMODE_Pos)                   /**< (UDPHS_TST Mask) OPMODE */
#define UDPHS_TST_OPMODE(value)               (UDPHS_TST_OPMODE_Msk & ((value) << UDPHS_TST_OPMODE_Pos)) 

/* -------- UDPHS_VERSION : (UDPHS Offset: 0xFC) ( R/ 32) UDPHS Version Register -------- */
#define UDPHS_VERSION_VERSION_Pos             _U_(0)                                               /**< (UDPHS_VERSION) Version of the Hardware Module Position */
#define UDPHS_VERSION_VERSION_Msk             (_U_(0xFFFF) << UDPHS_VERSION_VERSION_Pos)           /**< (UDPHS_VERSION) Version of the Hardware Module Mask */
#define UDPHS_VERSION_VERSION(value)          (UDPHS_VERSION_VERSION_Msk & ((value) << UDPHS_VERSION_VERSION_Pos))
#define UDPHS_VERSION_MFN_Pos                 _U_(16)                                              /**< (UDPHS_VERSION) Metal Fix Number Position */
#define UDPHS_VERSION_MFN_Msk                 (_U_(0x7) << UDPHS_VERSION_MFN_Pos)                  /**< (UDPHS_VERSION) Metal Fix Number Mask */
#define UDPHS_VERSION_MFN(value)              (UDPHS_VERSION_MFN_Msk & ((value) << UDPHS_VERSION_MFN_Pos))
#define UDPHS_VERSION_Msk                     _U_(0x0007FFFF)                                      /**< (UDPHS_VERSION) Register Mask  */


/** \brief UDPHS register offsets definitions */
#define UDPHS_DMANXTDSC_REG_OFST       (0x00)              /**< (UDPHS_DMANXTDSC) UDPHS DMA Next Descriptor Address Register (channel = 0) Offset */
#define UDPHS_DMAADDRESS_REG_OFST      (0x04)              /**< (UDPHS_DMAADDRESS) UDPHS DMA Channel Address Register (channel = 0) Offset */
#define UDPHS_DMACONTROL_REG_OFST      (0x08)              /**< (UDPHS_DMACONTROL) UDPHS DMA Channel Control Register (channel = 0) Offset */
#define UDPHS_DMASTATUS_REG_OFST       (0x0C)              /**< (UDPHS_DMASTATUS) UDPHS DMA Channel Status Register (channel = 0) Offset */
#define UDPHS_EPTCFG_REG_OFST          (0x00)              /**< (UDPHS_EPTCFG) UDPHS Endpoint Configuration Register (endpoint = 0) Offset */
#define UDPHS_EPTCTLENB_REG_OFST       (0x04)              /**< (UDPHS_EPTCTLENB) UDPHS Endpoint Control Enable Register (endpoint = 0) Offset */
#define UDPHS_EPTCTLDIS_REG_OFST       (0x08)              /**< (UDPHS_EPTCTLDIS) UDPHS Endpoint Control Disable Register (endpoint = 0) Offset */
#define UDPHS_EPTCTL_REG_OFST          (0x0C)              /**< (UDPHS_EPTCTL) UDPHS Endpoint Control Register (endpoint = 0) Offset */
#define UDPHS_EPTSETSTA_REG_OFST       (0x14)              /**< (UDPHS_EPTSETSTA) UDPHS Endpoint Set Status Register (endpoint = 0) Offset */
#define UDPHS_EPTCLRSTA_REG_OFST       (0x18)              /**< (UDPHS_EPTCLRSTA) UDPHS Endpoint Clear Status Register (endpoint = 0) Offset */
#define UDPHS_EPTSTA_REG_OFST          (0x1C)              /**< (UDPHS_EPTSTA) UDPHS Endpoint Status Register (endpoint = 0) Offset */
#define UDPHS_CTRL_REG_OFST            (0x00)              /**< (UDPHS_CTRL) UDPHS Control Register Offset */
#define UDPHS_FNUM_REG_OFST            (0x04)              /**< (UDPHS_FNUM) UDPHS Frame Number Register Offset */
#define UDPHS_IEN_REG_OFST             (0x10)              /**< (UDPHS_IEN) UDPHS Interrupt Enable Register Offset */
#define UDPHS_INTSTA_REG_OFST          (0x14)              /**< (UDPHS_INTSTA) UDPHS Interrupt Status Register Offset */
#define UDPHS_CLRINT_REG_OFST          (0x18)              /**< (UDPHS_CLRINT) UDPHS Clear Interrupt Register Offset */
#define UDPHS_EPTRST_REG_OFST          (0x1C)              /**< (UDPHS_EPTRST) UDPHS Endpoints Reset Register Offset */
#define UDPHS_TSTSOFCNT_REG_OFST       (0xD0)              /**< (UDPHS_TSTSOFCNT) UDPHS Test SOF Counter Register Offset */
#define UDPHS_TSTCNTA_REG_OFST         (0xD4)              /**< (UDPHS_TSTCNTA) UDPHS Test A Counter Register Offset */
#define UDPHS_TSTCNTB_REG_OFST         (0xD8)              /**< (UDPHS_TSTCNTB) UDPHS Test B Counter Register Offset */
#define UDPHS_TSTMODEREG_REG_OFST      (0xDC)              /**< (UDPHS_TSTMODEREG) UDPHS Test Mode Register Offset */
#define UDPHS_TST_REG_OFST             (0xE0)              /**< (UDPHS_TST) UDPHS Test Register Offset */
#define UDPHS_VERSION_REG_OFST         (0xFC)              /**< (UDPHS_VERSION) UDPHS Version Register Offset */

